<template>
  <div class="agreement">
    <cell title="用户协议">
      <span slot="left"><img src="@/assets/images/mobile_teacher/back.png" alt="" @click="$router.back(-1)"></span>
      <span slot="right"></span>
    </cell>
    <div class="agreement_contnet">
      <span>用户服务协议</span>
      <p>欢迎您使用《职教云》软件及服务！《职教云》是“课程+应用+平台”模式快速提高校方信息化水平的一款应用软件。
        平台特色：按需定制功能，在线随时学习，师生统一管理，信息安全保障，若您想使用《职教云》相应服务，您必须首先同意此协议。</p>
      <p>一、接受条款</p>
      <p>当您使用本软件代表已经认真阅读并同意此《用户服务协议》。</p>
      <p>此协议在必要时将随时进行修改更新，每次改动都会在职教云软件上发布，每次改动都会立即生效。</p>
      <p>如果您拒绝接受新的协议，您必须放弃使用轻启动提供的服务；若您继续使用职教云提供的服务，则表明您接受新的协议</p>
      <p>除非特别声明，其他增强服务的新功能将适用此协议。</p>
      <p>二、本服务内容、形式</p>
      <p>职教云有权根据实际情况随时调整服务内容，无需对任何人或第三方负责。</p>
      <p>本服务是指职教云软件所有功能的许可及服务（以下简称“本服务”）</p>
      <p>三、本服务许可的范围</p>
      <p>您可以为非商业目的在单一终端设备上安装、使用、显示、运行本软件。</p>
      <p>您可以为使用本软件及服务的目的用计算机可读形式制作本软件的一个副本，仅用作备份。备份副本必须包含原软件中含有的所有著作权信息。</p>
      <p>四、责任声明</p>
      <p>您同意使用职教云软件所存在的风险及一切后果将完全由您本人承担，职教云软件对此不承担任何责任。</p>
      <p>您必须选择与所安装手机相匹配的软件版本，否则，由于软件与手机型号不相匹配所导致的问题由您自行承担。</p>
      <p>职教云软件无法保证网络服务一定能满足用户的要求，也不保证网络服务的及时性、安全性、准确性。</p>
      <p>职教云软件不保证为方便用户而设置的外部链接的准确性和完整性，同时，对于该等外部链接指向的不由职教云软件实际控制的任何网页上的内容，职教云软件不承担任何责任。</p>
      <p>对于因不可抗力或职教云软件不能控制的原因造成的网络服务中断或其它缺陷，职教云软件不承担任何责任，但将尽力减少因此而给用户造成的损失和影响。</p>
      <p>五、用户行为规范</p>
      <p>您在遵守国家法律、法规、政策及本协议的前提下，可依本协议使用本软件。您无权也不得实施包括但不限于下列行为：
      </p>
      <p>删除本软件及其副本上关于著作权的信息；</p>
      <p>对本软件进行反向工程、反向汇编、反向编译，或者以其他方式尝试发现本软件的源代码；</p>
      <p>对有知识产权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点等；</p>
      <p>
        对本软件或者本软件运行过程中释放到任何终端内存中的数据、软件运行过程中客户端与服务器端的交互数据，以及本软件运行所必需的系统数据，进行复制、修改、增加、删除、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或第三方工具/服务接入本软件和相关系统；
      </p>
      <p>通过修改或伪造软件运行中的指令、数据，增加、删减、变动软件的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论这些行为是否为商业目的；</p>
      <p>自行或者授权他人、第三方软件对本软件及其组件、模块、数据进行干扰；</p>
      <p>其他违反法律法规、政策的行为。</p>
      <p>六、违约处理</p>
      <p>您理解并同意，对违反有关法律法规或本协议规定的行为，用户应独自承担由此而产生的一切法律责任</p>
      <p>您理解并同意，因您违反本协议或相关服务条款的规定，导致或产生第三方主张的任何索赔、要求或损失，您应当独立承担责任。</p>
      <p>七、附则</p>
      <p>本协议的订立、执行和解释及争议的解决均应适用中华人民共和国法律。</p>
      <p>如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。</p>
      <p>本协议解释权及修订权归职教云作者所有。</p>
    </div>
  </div>
</template>

<script>
import cell from '@/view/mobile_page/components/public_cell'
export default {
  components: {
    cell
  },

  data () {
    return {
    }
  },

  methods: {}
}
</script>

<style lang='less' scoped>
.agreement_contnet {
  background: #f3f3f3;
  padding: 0.2rem 0.2rem;
  color: #333333ff;
}
</style>
